Информационная_база_1/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДГА_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДГА_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДГА_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база_1/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
		
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	
	РассчитатьСуммуДокумента();

КонецПроцедуры

#КонецОбласти

//{{MRG[ <-> ]
#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	//<<<---Дьяков Г.А.----Скидка суммируется
	СкидкаОбщая = ПолучитьОбщуюСкидку(ТекущиеДанные.Скидка);
	//---Дьяков Г.А.----Скидка суммируется>>>
    КоэффициентСкидки = 1 - СкидкаОбщая / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры




#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры



&НаКлиенте
Процедура ДГА_ПрименитьСкидку()
    //<---Дьяков Г.А.---23.05.2023--- Применить скидку к ТЧ
	Массив_ТЧ = ДГА_ВернутьМассивТЧ();
	
	Если Массив_ТЧ.Количество() > 0 Тогда 
		Для Каждого СтрокаСТЧ Из Массив_ТЧ Цикл 
			Для Каждого Строка_ТЧ из СтрокаСТЧ Цикл
				ДГА_РассчитатьСуммуСтроки(Строка_ТЧ); 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//{{MRG[ <-> ]
//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//}}MRG[ <-> ]

                                                     


#КонецОбласти

&НаКлиенте
Функция ДГА_ВернутьМассивТЧ()    
	
	//<<---Дьяков Г.А.---23.05.2023--- Вернуть массив ТЧ
	Перем Массив_ТЧ;
	
	Массив_ТЧ = Новый Массив;
	Массив_ТЧ.Добавить(Объект.Товары);
	Массив_ТЧ.Добавить(Объект.Услуги);
	Возврат Массив_ТЧ;
	
КонецФункции


 
&НаКлиенте
Процедура ДГА_РассчитатьСуммуСтроки(Строка_ТЧ)
	
	
	//<<---Дьяков Г.А.---23.05.2023--- Рассчитать скидку для строки ТЧ 
	ТекущиеДанные = Строка_ТЧ;
	СкидкаОбщая = ПолучитьОбщуюСкидку(ТекущиеДанные.Скидка);
	ТекущиеДанные.Сумма = ((ТекущиеДанные.Цена - ТекущиеДанные.Цена * СкидкаОбщая/100) * ТекущиеДанные.Количество);
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры



&НаКлиенте
Процедура ДГА_СогласованнаяСкидкаПриИзмененииПосле()   
	//<<---Дьяков Г.А.---23.05.2023--- Рассчтитать скидку при изменении поля 	
	Массив_ТЧ = ДГА_ВернутьМассивТЧ();
	
	Если Массив_ТЧ.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
		ЭтотОбъект, Массив_ТЧ);	
		
		ПоказатьВопрос(Оповещение,
		"Пересчитать сумму с учетом назначенной скидки?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Применение скидки" // (необ.) заголовок 
		); 
		
	КонецЕсли;  
КонецПроцедуры


Функция ПолучитьОбщуюСкидку(СкидкаТЧ) 
	СкидкаОбщая = СкидкаТЧ + Объект.ДГА_СогласованнаяСкидка;
	Если СкидкаОбщая > 100 Тогда
		СкидкаОбщая = 100;
	КонецЕсли;	
	Возврат СкидкаОбщая
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Массив_ТЧ) Экспорт	
	//<<---Дьяков Г.А.---23.05.2023--- Процедура пересчетса ТЧ
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого СтрокаСТЧ Из Массив_ТЧ Цикл 
			Для Каждого Строка_ТЧ из СтрокаСТЧ Цикл
				ДГА_РассчитатьСуммуСтроки(Строка_ТЧ); 
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры   
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//#Область СлужебныеПроцедурыИФункции
//}}MRG[ <-> ]
                
#КонецОбласти

//{{MRG[ <-> ]
#Область ОбработчикиСобытийЭлементовФормы  
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//#Область ОбработчикиСобытийЭлементовФормы
//}}MRG[ <-> ]


#КонецОбласти
